MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX550F256L.PIC
      <edc:SFRDef edc:_addr="0x1F80FBAC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="44" edc:access="----------------------------nnnn" edc:cname="RPC11R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC11R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC11R" edc:desc="" edc:mask="0xf" edc:name="RPC11R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBB0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="45" edc:access="----------------------------nnnn" edc:cname="RPC12R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC12R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC12R" edc:desc="" edc:mask="0xf" edc:name="RPC12R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBB4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="46" edc:access="----------------------------nnnn" edc:cname="RPC13R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC13R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC13R" edc:desc="" edc:mask="0xf" edc:name="RPC13R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBB8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="47" edc:access="----------------------------nnnn" edc:cname="RPC14R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC14R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC14R" edc:desc="" edc:mask="0xf" edc:name="RPC14R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBBC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="48" edc:access="----------------------------nnnn" edc:cname="RPC15R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC15R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC15R" edc:desc="" edc:mask="0xf" edc:name="RPC15R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBC0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="49" edc:access="----------------------------nnnn" edc:cname="RPD0R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD0R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD0R" edc:desc="" edc:mask="0xf" edc:name="RPD0R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBC4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="50" edc:access="----------------------------nnnn" edc:cname="RPD1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD1R" edc:desc="" edc:mask="0xf" edc:name="RPD1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBC8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="51" edc:access="----------------------------nnnn" edc:cname="RPD2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD2R" edc:desc="" edc:mask="0xf" edc:name="RPD2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBCC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="52" edc:access="----------------------------nnnn" edc:cname="RPD3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD3R" edc:desc="" edc:mask="0xf" edc:name="RPD3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBD0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="53" edc:access="----------------------------nnnn" edc:cname="RPD4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD4R" edc:desc="" edc:mask="0xf" edc:name="RPD4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBD4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="54" edc:access="----------------------------nnnn" edc:cname="RPD5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD5R" edc:desc="" edc:mask="0xf" edc:name="RPD5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBD8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="55" edc:access="----------------------------nnnn" edc:cname="RPD6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD6R" edc:desc="" edc:mask="0xf" edc:name="RPD6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FBDC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="56" edc:access="----------------------------nnnn" edc:cname="RPD7R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPD7R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD7R" edc:desc="" edc:mask="0xf" edc:name="RPD7R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
