MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX550F256L.PIC
      <edc:SFRDef edc:_addr="0x1F886570" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="6" edc:access="----------------n-n-------------" edc:cname="CNCONF" edc:desc="" edc:grp="PORTF" edc:impl="0xffffbfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000-00000000000000" edc:name="CNCONF" edc:nzwidth="0x20" edc:por="00000000000000000-00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886580" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="6" edc:access="------------------nn---n--nnnnnn" edc:cname="CNENF" edc:desc="" edc:grp="PORTF" edc:impl="0xffc0313f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000--------xx---x--xxxxxx" edc:name="CNENF" edc:nzwidth="0x20" edc:por="0000000000--------xx---x--xxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEF0" edc:desc="" edc:mask="0x1" edc:name="CNIEF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF1" edc:desc="" edc:mask="0x1" edc:name="CNIEF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF2" edc:desc="" edc:mask="0x1" edc:name="CNIEF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF3" edc:desc="" edc:mask="0x1" edc:name="CNIEF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF4" edc:desc="" edc:mask="0x1" edc:name="CNIEF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF5" edc:desc="" edc:mask="0x1" edc:name="CNIEF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEF8" edc:desc="" edc:mask="0x1" edc:name="CNIEF8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEF12" edc:desc="" edc:mask="0x1" edc:name="CNIEF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF13" edc:desc="" edc:mask="0x1" edc:name="CNIEF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886590" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="6" edc:access="------------------nn---n--nnnnnn" edc:cname="CNSTATF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff313f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------xx---x--xxxxxx" edc:name="CNSTATF" edc:nzwidth="0x20" edc:por="------------------xx---x--xxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATF0" edc:desc="" edc:mask="0x1" edc:name="CNSTATF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF1" edc:desc="" edc:mask="0x1" edc:name="CNSTATF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF2" edc:desc="" edc:mask="0x1" edc:name="CNSTATF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF3" edc:desc="" edc:mask="0x1" edc:name="CNSTATF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF4" edc:desc="" edc:mask="0x1" edc:name="CNSTATF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF5" edc:desc="" edc:mask="0x1" edc:name="CNSTATF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF8" edc:desc="" edc:mask="0x1" edc:name="CNSTATF8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF12" edc:desc="" edc:mask="0x1" edc:name="CNSTATF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF13" edc:desc="" edc:mask="0x1" edc:name="CNSTATF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8865A0" edc:offset="96"/>
      <edc:SFRDef edc:_addr="0x1F886600" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="7" edc:access="----------------n-----nnnn------" edc:cname="ANSELG" edc:desc="" edc:grp="PORTG" edc:impl="0xffff83c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x-----xxxx------" edc:name="ANSELG" edc:nzwidth="0x20" edc:por="----------------x-----xxxx------" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSG6" edc:desc="" edc:mask="0x1" edc:name="ANSG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG7" edc:desc="" edc:mask="0x1" edc:name="ANSG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG8" edc:desc="" edc:mask="0x1" edc:name="ANSG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG9" edc:desc="" edc:mask="0x1" edc:name="ANSG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSG15" edc:desc="" edc:mask="0x1" edc:name="ANSG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
