MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX550F256L.PIC
    <edc:Pin>
      <!--Pin 89-->
      <edc:VirtualPin edc:name="RG1"/>
      <edc:VirtualPin edc:name="PMD9"/>
      <edc:VirtualPin edc:name="RPG1" edc:ppsgroup="1" edc:ppsval="12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 90-->
      <edc:VirtualPin edc:name="RG0"/>
      <edc:VirtualPin edc:name="PMD8"/>
      <edc:VirtualPin edc:name="RPG0" edc:ppsgroup="2" edc:ppsval="12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 91-->
      <edc:VirtualPin edc:name="RA6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 92-->
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="CTED8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 93-->
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="AN46"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 94-->
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="AN47"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 95-->
      <edc:VirtualPin edc:name="RG14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 96-->
      <edc:VirtualPin edc:name="RG12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 97-->
      <edc:VirtualPin edc:name="RG13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 98-->
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="AN20"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 99-->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="CTPLS"/>
      <edc:VirtualPin edc:name="RPE3" edc:ppsgroup="3" edc:ppsval="6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 100-->
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="AN21"/>
    </edc:Pin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T2CK" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1RX" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2RX" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U5CTS" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI4" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="REFCLKI" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T5CK" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3RX" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4CTS" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI1" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI2" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="C1RX" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T4CK" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC5" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1CTS" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2CTS" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS3" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS4" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT1" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T3CK" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC1" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3CTS" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4RX" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U5RX" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFA" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3TX" edc:ppsgroup="1" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4RTS" edc:ppsgroup="1" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="1" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC3" edc:ppsgroup="1" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1TX" edc:ppsgroup="1" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsgroup="1" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO3" edc:ppsgroup="1" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO4" edc:ppsgroup="1" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2TX" edc:ppsgroup="2" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1TX" edc:ppsgroup="2" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U5RTS" edc:ppsgroup="2" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="2" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="2" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC4" edc:ppsgroup="2" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C3OUT" edc:ppsgroup="2" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO3" edc:ppsgroup="2" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO4" edc:ppsgroup="2" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3RTS" edc:ppsgroup="3" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4TX" edc:ppsgroup="3" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="REFCLKO" edc:ppsgroup="3" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U5TX" edc:ppsgroup="3" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="3" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="3" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC5" edc:ppsgroup="3" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsgroup="3" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS3" edc:ppsgroup="3" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS4" edc:ppsgroup="3" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2RTS" edc:ppsgroup="4" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1RTS" edc:ppsgroup="4" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U5TX" edc:ppsgroup="4" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="4" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC2" edc:ppsgroup="4" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC1" edc:ppsgroup="4" edc:ppsval="12"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
